src/cf/InformationRegisters/МП_ИзмененныеНастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_ИзмененныеНастройкиСинхронизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекОбменаСМобильнымКлиентом</v8:Type>
						<v8:Type>cfg:EnumRef.МП_ТипыНастроекПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_ИзмененныеНастройкиСинхронизации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Делает запись об изменившейся насторойке для текущего пользователя
//
Процедура ДобавитьЗапись(Пользователь, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписиИзмененныхНастроек = 
		РегистрыСведений.МП_ИзмененныеНастройкиСинхронизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписиИзмененныхНастроек.Пользователь = Пользователь;
	МенеджерЗаписиИзмененныхНастроек.Настройка = Настройка;
	МенеджерЗаписиИзмененныхНастроек.ОтметкаВремени = ОтметкиВремени.Текущая();
	МенеджерЗаписиИзмененныхНастроек.Записать();
	
КонецПроцедуры

#КонецЕсли
